### jupyter사용방법
* h : help
* a, b : 셀 추가
* m, y : 마크업 또는 코드
* dd : 셀 한칸 삭제
* ctrl + enter : 실행

### pandas import

In [1]:
import pandas as pd
df = pd.read_csv("data/1.pandas.csv")

In [2]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [3]:
name = "홍길동"
age = 20
print( name )
age

홍길동

20

In [4]:
print( df['name'] )
print( df.age )

print( df[['name', 'age']] )

print( df[1:3] )
print( df[:3] )
print( df[1:] )

0     Kim
1     Cho
2    Choi
3      jo
Name: name, dtype: object
0    20
1    30
2    40
3    50
Name: age, dtype: int64
   name  age
0   Kim   20
1   Cho   30
2  Choi   40
3    jo   50
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

### loc : DF.loc[ index조건식, 컬럼 조건식 ]
### index조건식은 필수, 컬럼 조건식은 생략 가능

In [5]:
print( df.loc[1:3 , 'name'] )
print('------------------------------')
print( df.loc[1:3 , ['name', 'score'] ] )
print('------------------------------')
print( df.loc[ : , ['name', 'score'] ] )
print('------------------------------')
print( df.loc[1:3 , ] )
print('------------------------------')
print( df.loc[1:3 , ['name', 'score'] ] )
print('------------------------------')
print( df['grade'] == 'A' )
print('------------------------------')
print( df[ df['grade'] == 'A' ] ) # true만 가져옴
print('------------------------------')

1     Cho
2    Choi
3      jo
Name: name, dtype: object
------------------------------
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
------------------------------
   name  score
0   Kim  100.0
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
------------------------------
   name  score grade  age
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50
------------------------------
   name  score
1   Cho   95.0
2  Choi   90.5
3    jo   85.7
------------------------------
0     True
1     True
2    False
3    False
Name: grade, dtype: bool
------------------------------
  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
------------------------------

In [6]:
df.drop(2)

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30
3   jo   85.7     B   50

In [7]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [8]:
df.drop(1, inplace = True)
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40
3    jo   85.7     B   50

#### axis
* 열 또는 행 중에 어떤한 값을 기준으로 설정할 지 결정
* axis는 기본적으로 행(index)를 기준으로 설정 되면 axis = 0 이다.
* axis = 0 : index 삭제
* axis = 1 : 컬럼, 열 삭제

In [9]:
df.drop(3, axis=0, inplace = True)
df

   name  score grade  age
0   Kim  100.0     A   20
2  Choi   90.5     B   40

In [10]:
df.drop("score", axis=1, inplace = True)
df

   name grade  age
0   Kim     A   20
2  Choi     B   40

### Boolean 처리
* 특정 데이터 연산하면 결과는 True, False이다.
* DataFrame에 True값을 전달하면 해당 위치의 값들을 얻어온다.

In [11]:
df = pd.read_csv("data/1.pandas.csv")
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [12]:
df["score"] < 95

0    False
1    False
2     True
3     True
Name: score, dtype: bool

In [13]:
df[df["score"] < 95]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [14]:
df[df["score"] < 95]["name"]

2    Choi
3      jo
Name: name, dtype: object

In [15]:
df[df["score"] < 95][["name"]]

   name
2  Choi
3    jo

In [16]:
df[df["score"] < 95][["name", "score"]]

   name  score
2  Choi   90.5
3    jo   85.7

In [17]:
df.loc[ df["score"] < 95 , "name" ]

2    Choi
3      jo
Name: name, dtype: object

In [18]:
df.loc[ df["score"] < 95, ["name", "score"] ]

   name  score
2  Choi   90.5
3    jo   85.7

### 컬럼이 name~grade까지 표현

In [19]:
df.loc[ df["score"] < 95, 'name':'grade' ]

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

In [20]:
df[ df["score"] < 95]

   name  score grade  age
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [21]:
df[ df["score"] < 95].loc[ : , "name":"grade" ]

   name  score grade
2  Choi   90.5     B
3    jo   85.7     B

### DataFrame 명령어

In [22]:
df

   name  score grade  age
0   Kim  100.0     A   20
1   Cho   95.0     A   30
2  Choi   90.5     B   40
3    jo   85.7     B   50

In [23]:
df.columns

Index(['name', 'score', 'grade', 'age'], dtype='object')

In [24]:
df.values

array([['Kim', 100.0, 'A', 20],
       ['Cho', 95.0, 'A', 30],
       ['Choi', 90.5, 'B', 40],
       ['jo', 85.7, 'B', 50]], dtype=object)

* dtypes
    - 자료형을 알려준다
    - object : 문자열
    - float : 실수
    - int : 정수

In [25]:
df.dtypes

name      object
score    float64
grade     object
age        int64
dtype: object

In [26]:
df["grade"]

0    A
1    A
2    B
3    B
Name: grade, dtype: object

In [27]:
df["grade"].isin(['A'])

0     True
1     True
2    False
3    False
Name: grade, dtype: bool

In [28]:
df[ df["grade"].isin(['A']) ]

  name  score grade  age
0  Kim  100.0     A   20
1  Cho   95.0     A   30

In [29]:
df.loc[ df["grade"].isin(['A']), "name" : "grade" ]

  name  score grade
0  Kim  100.0     A
1  Cho   95.0     A

In [30]:
df.loc[ df["grade"].isin(['A']), ["name", "grade"] ]

  name grade
0  Kim     A
1  Cho     A

In [31]:
index_name = ["김씨1", "김씨2", "김씨3", "김씨4"]
df.index = index_name
df

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40
김씨4    jo   85.7     B   50

In [32]:
df["김씨1":"김씨3"]

     name  score grade  age
김씨1   Kim  100.0     A   20
김씨2   Cho   95.0     A   30
김씨3  Choi   90.5     B   40